#############################################################################
### Търсене и извличане на информация. Приложение на дълбоко машинно обучение
### Стоян Михов
### Зимен семестър 2025/2026
#############################################################################
###
### Домашно задание 2
###
#############################################################################

import numpy as np

#############################################################


def sigmoid(x):
    return 1 / (1 + np.exp(-x))


def lossAndGradient(u_w, Vt, W, q):
    ###  Векторът u_w е влагането на целевата дума. shape(u_w) = M.
    ###  Матрицата Vt представя влаганията на контекстните думи. shape(Vt) = (n+1)xM.
    ###  Първият ред на Vt е влагането на коректната контекстна дума, а
    ###  следващите n реда са влаганията на извадката от негативни контекстни думи
    ###  Матрицата W е параметър с теглата на квадратичната форма. shape(W) = MxM.
    ###  Векторът q съдържа логаритъм от n по вероятностите за контекстните думи. shape(q) = n+1.
    ###
    ###  функцията връща J -- загубата в тази точка;
    ###                  du_w -- градиентът на J спрямо u_w;
    ###                  dVt --  градиентът на J спрямо Vt.
    ###                  dW --  градиентът на J спрямо W.
    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 7-15 реда

    eps = 1e-12  # to avoid log(0)

    t = W @ u_w  # shape(t) = M
    s = Vt @ t  # shape(s) = (n+1)
    a = -np.ones(Vt.shape[0])  # shape(a) = (n+1)
    a[0] = 1.0
    z = a * (s - q)  # shape(z) = (n+1)

    sig_z = sigmoid(z)
    J = -np.sum(np.log(sig_z + eps))

    r = (sig_z - 1) * a
    du_w = W.T @ Vt.T @ r
    dVt = np.outer(r, t)
    dW = np.outer((Vt.T @ r), u_w)

    #### Край на Вашия код
    #############################################################################

    return J, du_w, dVt, dW


def lossAndGradientCumulative(u_w, Vt, W, q):
    ###  Изчисляване на загуба и градиент за цяла партида
    ###  Тук за всяко от наблюденията се извиква lossAndGradient
    ###  и се акумулират загубата и градиентите за S-те наблюдения
    Cdu_w = []
    CdVt = []
    CJ = 0
    CdW = 0
    S = u_w.shape[0]
    for i in range(S):
        J, du_w, dVt, dW = lossAndGradient(u_w[i], Vt[i], W, q[i])
        Cdu_w.append(du_w / S)
        CdVt.append(dVt / S)
        CdW += dW / S
        CJ += J / S
    return CJ, Cdu_w, CdVt, CdW


def lossAndGradientBatched(u_w, Vt, W, q):
    ###  Изчисляване на загуба и градиент за цяла партида.
    ###  Тук едновременно се изчислява загубата и градиентите за S наблюдения.
    ###  Матрицата u_w представя влаганията на целевите думи и shape(u_w) = SxM.
    ###  Тензорът Vt представя S матрици от влагания на контекстните думи и shape(Vt) = Sx(n+1)xM.
    ###  Матрицата W е параметър с теглата на квадратичната форма. shape(W) = MxM.
    ###  Матрицата q съдържа логаритъм от n по вероятностите за контекстните думи. shape(q) = Sx(n+1).
    ###  Във всяка от S-те матрици на Vt в първия ред е влагането на коректната контекстна дума, а
    ###  следващите n реда са влаганията на извадката от негативни контекстни думи.
    ###
    ###  Функцията връща J -- загубата за цялата партида;
    ###                  du_w -- матрица с размерност SxM с градиентите на J спрямо u_w за всяко наблюдение;
    ###                  dVt --  с размерност Sx(n+1)xM -- S градиента на J спрямо Vt.
    ###                  dW --  матрица с размерност MxM -- партидния градиент на J спрямо W.
    #############################################################
    ###  От вас се очаква вместо да акумулирате резултатите за отделните наблюдения,
    ###  да използвате тензорни операции, чрез които наведнъж да получите
    ###  резултата за цялата партида. Очаква се по този начин да получите над 2 пъти по-бързо изпълнение.
    #############################################################

    #############################################################################
    #### Начало на Вашия код. На мястото на pass се очакват 10-20 реда

    eps = 1e-12
    S = u_w.shape[0]  # batch size

    t = u_w @ W.T
    s = np.einsum('snm,sm->sn', Vt, t)
    a = -np.ones(Vt.shape[1])
    a[0] = 1.0
    z = (s - q) * a

    sig_z = sigmoid(z)
    J = -np.sum(np.log(sig_z + eps)) / S

    r = (sig_z - 1.0) * a
    dt = np.einsum('snm,sn->sm', Vt, r)
    du_w = dt @ W
    dVt = np.einsum('sn,sm->snm', r, t)
    dW = np.einsum('sm,sk->mk', dt, u_w) / S

    du_w = du_w / S
    dVt = dVt / S

    #### Край на Вашия код
    #############################################################################
    return J, du_w, dVt, dW
